In [2]:
import pandas as pd
import numpy as np

sales_df = pd.DataFrame({
    "OrderID": [1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012],
    "Customer": ["Arman","Riya","Kunal","Sneha","Vikram","Pooja","Rahul","Neha","Arjun","Simran","Aman","Zoya"],
    "City": ["Delhi","Mumbai","Delhi","Pune","Mumbai","Delhi","Pune","Delhi","Mumbai","Pune","Delhi","Mumbai"],
    "Category": ["Electronics","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics"],
    "Amount": [25000,3000,18000,22000,4500,27000,15000,3500,20000,24000,3200,26000],
    "Quantity": [1,2,1,1,3,1,2,2,1,1,2,1],
    "PaymentMode": ["UPI","Card","UPI","Cash","Card","UPI","Cash","UPI","Card","Cash","Card","UPI"]
})

sales_df

    OrderID Customer    City     Category  Amount  Quantity PaymentMode
0      1001    Arman   Delhi  Electronics   25000         1         UPI
1      1002     Riya  Mumbai     Clothing    3000         2        Card
2      1003    Kunal   Delhi  Electronics   18000         1         UPI
3      1004    Sneha    Pune    Furniture   22000         1        Cash
4      1005   Vikram  Mumbai     Clothing    4500         3        Card
5      1006    Pooja   Delhi  Electronics   27000         1         UPI
6      1007    Rahul    Pune    Furniture   15000         2        Cash
7      1008     Neha   Delhi     Clothing    3500         2         UPI
8      1009    Arjun  Mumbai  Electronics   20000         1        Card
9      1010   Simran    Pune    Furniture   24000         1        Cash
10     1011     Aman   Delhi     Clothing    3200         2        Card
11     1012     Zoya  Mumbai  Electronics   26000         1         UPI

In [3]:
# Average Amount Per Category
pd.pivot_table(sales_df,values="Amount",index="Category",aggfunc="mean")

                   Amount
Category
Clothing      3550.000000
Electronics  23200.000000
Furniture    20333.333333

In [4]:
# Total Amount Per Category
pd.pivot_table(sales_df,values="Amount",index="Category",aggfunc="sum")

             Amount
Category
Clothing      14200
Electronics  116000
Furniture     61000

In [5]:
# Multiple Aggregation
pd.pivot_table(sales_df,values="Amount",index="Category",aggfunc=["mean","sum","max"])

                     mean     sum    max
                   Amount  Amount Amount
Category
Clothing      3550.000000   14200   4500
Electronics  23200.000000  116000  27000
Furniture    20333.333333   61000  24000

In [6]:
# Multiple Column Pivot
# Avg Amount + Avg Quantity
pd.pivot_table(sales_df,values=["Amount","Quantity"],index="Category",aggfunc="mean")

                   Amount  Quantity
Category
Clothing      3550.000000  2.250000
Electronics  23200.000000  1.000000
Furniture    20333.333333  1.333333

In [8]:
# Matrix Pivot (Excel Style)
# Category vs City Avg Amount
pd.pivot_table(sales_df,values="Amount",index="Category",columns="City",aggfunc="mean",fill_value=0)

City                Delhi   Mumbai          Pune
Category
Clothing      3350.000000   3750.0      0.000000
Electronics  23333.333333  23000.0      0.000000
Furniture        0.000000      0.0  20333.333333

In [9]:
# Revenue by Category vs Payment Mode
pd.pivot_table(sales_df,values="Amount",index="Category",columns="PaymentMode",fill_value=0)

PaymentMode          Card          Cash      UPI
Category
Clothing      3566.666667      0.000000   3500.0
Electronics  20000.000000      0.000000  24000.0
Furniture        0.000000  20333.333333      0.0